20230119001157-openapi.org
:PROPERTIES:
:ID:       a833c386-3cca-49eb-969a-5af58991250d
:END:
#+title: OpenAPI
* 概要
OpenAPIはREST APIのインターフェースを記述するための仕様。仕様に基づいて見やすいページにエクスポートしたり、モックサーバを起動できる周辺ツールが開発されている。
* Memo
** ロゴ設定

エクスポートしたときのロゴ画像を設定できる。

#+begin_src yaml
info:
  x-logo:
    url: https://example.com/sample.png
#+end_src
** タグの表示名

エクスポートしたときのタグの表示名を設定できる。

#+begin_src yaml
tags:
  - name: Setting
    x-displayName: ⚙️設定
    description: |
      これは設定
#+end_src

* Tasks
** DONE 雛形を作成する
CLOSED: [2023-04-27 Thu 23:39]
:LOGBOOK:
CLOCK: [2023-04-27 Thu 23:05]--[2023-04-27 Thu 23:30] =>  0:25
CLOCK: [2023-04-27 Thu 00:40]--[2023-04-27 Thu 01:05] =>  0:25
CLOCK: [2023-04-27 Thu 00:15]--[2023-04-27 Thu 00:40] =>  0:25
CLOCK: [2023-04-27 Thu 00:03]--[2023-04-27 Thu 00:03] =>  0:00
:END:
マイベストを作る。ファイル分割をしてわかりやすくした。
** DONE ポータブルなバリデーションツール
CLOSED: [2023-04-27 Thu 00:03]
ポータブルに使える、実装と設計の差分を調べるCLIツールを作る。
*** DONE リファクタ [4/4]
CLOSED: [2023-02-08 Wed 23:19]
:PROPERTIES:
:Effort:   3:00
:END:
:LOGBOOK:
CLOCK: [2023-02-05 Sun 21:15]--[2023-02-05 Sun 21:40] =>  0:25
CLOCK: [2023-02-05 Sun 20:50]--[2023-02-05 Sun 21:15] =>  0:25
CLOCK: [2023-02-05 Sun 20:24]--[2023-02-05 Sun 20:49] =>  0:25
CLOCK: [2023-02-05 Sun 16:38]--[2023-02-05 Sun 17:03] =>  0:25
CLOCK: [2023-02-05 Sun 16:12]--[2023-02-05 Sun 16:37] =>  0:25
CLOCK: [2023-02-05 Sun 15:37]--[2023-02-05 Sun 16:02] =>  0:25
CLOCK: [2023-02-05 Sun 15:07]--[2023-02-05 Sun 15:32] =>  0:25
CLOCK: [2023-02-05 Sun 01:03]--[2023-02-05 Sun 01:28] =>  0:25
CLOCK: [2023-02-05 Sun 00:38]--[2023-02-05 Sun 01:03] =>  0:25
CLOCK: [2023-02-04 Sat 12:47]--[2023-02-04 Sat 13:12] =>  0:25
CLOCK: [2023-02-04 Sat 11:25]--[2023-02-04 Sat 11:50] =>  0:25
CLOCK: [2023-02-04 Sat 11:00]--[2023-02-04 Sat 11:25] =>  0:25
CLOCK: [2023-02-04 Sat 10:19]--[2023-02-04 Sat 10:44] =>  0:25
CLOCK: [2023-02-04 Sat 00:23]--[2023-02-04 Sat 00:48] =>  0:25
CLOCK: [2023-02-03 Fri 23:58]--[2023-02-04 Sat 00:23] =>  0:25
:END:

- [X] ファイル分割
- [X] CLIコマンド化
- [X] テストできるようにする
- [X] docker-composeで起動できるようにする
  - サーバをdockerで起動すると、ホストとポートが異なるので正しくチェックできない
  - dockerを使わずにテスト実行時にGoでサーバを立てるようにした(これがベスト)

*** DONE 関数を分割
CLOSED: [2023-04-27 Thu 00:03]
:LOGBOOK:
CLOCK: [2023-02-09 Thu 23:47]--[2023-02-10 Fri 00:12] =>  0:25
CLOCK: [2023-02-09 Thu 23:22]--[2023-02-09 Thu 23:47] =>  0:25
CLOCK: [2023-02-09 Thu 22:34]--[2023-02-09 Thu 22:59] =>  0:25
CLOCK: [2023-02-09 Thu 00:17]--[2023-02-09 Thu 00:42] =>  0:25
CLOCK: [2023-02-08 Wed 23:45]--[2023-02-09 Thu 00:10] =>  0:25
CLOCK: [2023-02-08 Wed 23:19]--[2023-02-08 Wed 23:44] =>  0:25
:END:
でかいので分ける。
*** CLOSE カバレッジ表示できるようにする
CLOSED: [2023-04-27 Thu 00:03]
スキーマのパス一覧を使って全体がわかるので、そこからどこまでカバーしてるか計算する。
*** DONE テスト用ライブラリとして使えるようにする
CLOSED: [2023-04-27 Thu 00:03]
assert的な感じで使えるようにする。
** CLOSE [[https://tech.buysell-technologies.com/entry/2021/09/21/095238#openapi-validator-%E3%81%AE%E5%B0%8E%E5%85%A5][治安のいいOpenAPIの開発環境を作る - バイセル Tech Blog]]
CLOSED: [2023-04-27 Thu 00:03]
[[id:eaf6ed04-7927-4a16-ba94-fbb9f6e76166][CI]]でメンテしやすさを保証する。
* Reference
** [[https://www.openapis.org/blog/2021/02/16/migrating-from-openapi-3-0-to-3-1-0][Migrating from OpenAPI 3.0 to 3.1.0 - OpenAPI Initiative]]
3.1.0の破壊的変更。
** [[https://openapi-generator.tech/docs/generators/php/][Documentation for the php Generator | OpenAPI Generator]]
生成オプションの一覧。
** [[https://swagger.io/docs/specification/data-models/oneof-anyof-allof-not/][oneOf, anyOf, allOf, not]]
allofでコンポーネントを組み合わせ、共通化できる。
** [[https://github.com/freee/freee-api-schema][freee/freee-api-schema: schema file of freee API]]
freeeのAPIスキーマ。openapiの参考にする。
** [[https://baasinfo.net/?p=4418][OAuth vs SAML vs OpenID Connect vs SSO それぞれの違い。 │ BaaS info !!]]
よくわからなくなる3つ。
** [[https://qiita.com/tkek321/items/55a1c3a3f78356045c03][Keycloak で Opent ID Connect 認可コードフローをやってみる - Qiita]]
Keycloakの解説記事。
** [[https://tech-blog.rakus.co.jp/entry/20220408/architect][認証アーキテクチャの更新について検討してみた - RAKUS Developers Blog | ラクス エンジニアブログ]]
実装記事。
* Archives
** DONE OpenAPIの使い方を調べる
CLOSED: [2023-01-19 Thu 00:13]
:LOGBOOK:
CLOCK: [2023-01-16 Mon 23:34]--[2023-01-16 Mon 23:59] =>  0:25
CLOCK: [2023-01-15 Sun 23:00]--[2023-01-15 Sun 23:25] =>  0:25
CLOCK: [2023-01-15 Sun 22:31]--[2023-01-15 Sun 22:56] =>  0:25
:END:
API設計・ドキュメント作成をスムーズに行えるようにする。

- モックサーバ
- PDF生成

まあ、楽にできる。いくつかの例からyamlを覚えればいいだけだ。あとは継続的にドキュメントをアップデートできる仕組み…たとえば実装と合っているかテストする([[id:e04aa1a3-509c-45b2-ac64-53d69c961214][Rails]]でいうところのCommitee)を入れれば、完璧。

- [[https://nextat.co.jp/staff/archives/253][LaravelアプリケーションのAPIがSwagger/OpenAPIドキュメントに準拠していることを透過的にテストする｜Laravel｜PHP｜開発ブログ｜株式会社Nextat（ネクスタット）]]
- [[https://github.com/lezhnev74/openapi-psr7-validator][lezhnev74/openapi-psr7-validator: It validates PSR-7 messages (HTTP request/response) against OpenAPI specifications]]
** DONE my_openapi整理
CLOSED: [2023-01-29 Sun 12:32]
:PROPERTIES:
:Effort:   0:30
:END:
:LOGBOOK:
CLOCK: [2023-01-27 Fri 22:45]--[2023-01-27 Fri 23:10] =>  0:25
CLOCK: [2023-01-27 Fri 22:19]--[2023-01-27 Fri 22:44] =>  0:25
:END:
- [[https://github.com/kijimaD/my_openapi][kijimaD/my_openapi]]

- 例を整理した。
- Lintを[[id:2d35ac9e-554a-4142-bba7-3c614cbfe4c4][GitHub Actions]]で実行させた
- ビルドを[[id:2d35ac9e-554a-4142-bba7-3c614cbfe4c4][GitHub Actions]]で実行させた
