20230119001157-openapi.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-07-25 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>OpenAPI</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">OpenAPI</h1>
<div id="outline-container-org0271142" class="outline-2">
<h2 id="org0271142"><a href="#org0271142">概要</a></h2>
<div class="outline-text-2" id="text-org0271142">
<p>
OpenAPIはREST APIのインターフェースを記述するための仕様。仕様に基づいて見やすいページにエクスポートしたり、モックサーバを起動できる周辺ツールが開発されている。
</p>
</div>
</div>
<div id="outline-container-org6d961b2" class="outline-2">
<h2 id="org6d961b2"><a href="#org6d961b2">Memo</a></h2>
<div class="outline-text-2" id="text-org6d961b2">
</div>
<div id="outline-container-orga431c94" class="outline-3">
<h3 id="orga431c94"><a href="#orga431c94">ロゴ設定</a></h3>
<div class="outline-text-3" id="text-orga431c94">
<p>
エクスポートしたときのロゴ画像を設定できる。
</p>

<div class="org-src-container">
<pre class="src src-yaml">info:
  x-logo:
    url: https://example.com/sample.png
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc07b2d6" class="outline-3">
<h3 id="orgc07b2d6"><a href="#orgc07b2d6">タグの表示名</a></h3>
<div class="outline-text-3" id="text-orgc07b2d6">
<p>
エクスポートしたときのタグの表示名を設定できる。
</p>

<div class="org-src-container">
<pre class="src src-yaml">tags:
  - name: Setting
    x-displayName: ⚙️設定
    description: |
      これは設定
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org77a563a" class="outline-2">
<h2 id="org77a563a"><a href="#org77a563a">Tasks</a></h2>
<div class="outline-text-2" id="text-org77a563a">
</div>
<div id="outline-container-org20472ae" class="outline-3">
<h3 id="org20472ae"><a href="#org20472ae"><span class="done DONE">DONE</span> 雛形を作成する</a></h3>
<div class="outline-text-3" id="text-org20472ae">
<p>
マイベストを作る。ファイル分割をしてわかりやすくした。
</p>
</div>
</div>
<div id="outline-container-org0db041c" class="outline-3">
<h3 id="org0db041c"><a href="#org0db041c"><span class="done DONE">DONE</span> ポータブルなバリデーションツール</a></h3>
<div class="outline-text-3" id="text-org0db041c">
<p>
ポータブルに使える、実装と設計の差分を調べるCLIツールを作る。
</p>
</div>
<div id="outline-container-org25a75aa" class="outline-4">
<h4 id="org25a75aa"><a href="#org25a75aa"><span class="done DONE">DONE</span> リファクタ <code>[4/4]</code></a></h4>
<div class="outline-text-4" id="text-org25a75aa">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> ファイル分割</li>
<li class="on"><input type='checkbox' checked='checked' /> CLIコマンド化</li>
<li class="on"><input type='checkbox' checked='checked' /> テストできるようにする</li>
<li class="on"><input type='checkbox' checked='checked' /> docker-composeで起動できるようにする
<ul class="org-ul">
<li>サーバをdockerで起動すると、ホストとポートが異なるので正しくチェックできない</li>
<li>dockerを使わずにテスト実行時にGoでサーバを立てるようにした(これがベスト)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org8b657ad" class="outline-4">
<h4 id="org8b657ad"><a href="#org8b657ad"><span class="done DONE">DONE</span> 関数を分割</a></h4>
<div class="outline-text-4" id="text-org8b657ad">
<p>
でかいので分ける。
</p>
</div>
</div>
<div id="outline-container-org9a47934" class="outline-4">
<h4 id="org9a47934"><a href="#org9a47934"><span class="done CLOSE">CLOSE</span> カバレッジ表示できるようにする</a></h4>
<div class="outline-text-4" id="text-org9a47934">
<p>
スキーマのパス一覧を使って全体がわかるので、そこからどこまでカバーしてるか計算する。
</p>
</div>
</div>
<div id="outline-container-orgf5367bb" class="outline-4">
<h4 id="orgf5367bb"><a href="#orgf5367bb"><span class="done DONE">DONE</span> テスト用ライブラリとして使えるようにする</a></h4>
<div class="outline-text-4" id="text-orgf5367bb">
<p>
assert的な感じで使えるようにする。
</p>
</div>
</div>
</div>
<div id="outline-container-org25e0e06" class="outline-3">
<h3 id="org25e0e06"><a href="#org25e0e06"><span class="done CLOSE">CLOSE</span> <a href="https://tech.buysell-technologies.com/entry/2021/09/21/095238#openapi-validator-%E3%81%AE%E5%B0%8E%E5%85%A5">治安のいいOpenAPIの開発環境を作る - バイセル Tech Blog</a></a></h3>
<div class="outline-text-3" id="text-org25e0e06">
<p>
<a href="20220212141124-ci.html#ID-eaf6ed04-7927-4a16-ba94-fbb9f6e76166">CI</a>でメンテしやすさを保証する。
</p>
</div>
</div>
</div>
<div id="outline-container-orge854fea" class="outline-2">
<h2 id="orge854fea"><a href="#orge854fea">Reference</a></h2>
<div class="outline-text-2" id="text-orge854fea">
</div>
<div id="outline-container-orgdb24a51" class="outline-3">
<h3 id="orgdb24a51"><a href="#orgdb24a51"><a href="https://www.openapis.org/blog/2021/02/16/migrating-from-openapi-3-0-to-3-1-0">Migrating from OpenAPI 3.0 to 3.1.0 - OpenAPI Initiative</a></a></h3>
<div class="outline-text-3" id="text-orgdb24a51">
<p>
3.1.0の破壊的変更。
</p>
</div>
</div>
<div id="outline-container-org21137fc" class="outline-3">
<h3 id="org21137fc"><a href="#org21137fc"><a href="https://openapi-generator.tech/docs/generators/php/">Documentation for the php Generator | OpenAPI Generator</a></a></h3>
<div class="outline-text-3" id="text-org21137fc">
<p>
生成オプションの一覧。
</p>
</div>
</div>
<div id="outline-container-org6465464" class="outline-3">
<h3 id="org6465464"><a href="#org6465464"><a href="https://swagger.io/docs/specification/data-models/oneof-anyof-allof-not/">oneOf, anyOf, allOf, not</a></a></h3>
<div class="outline-text-3" id="text-org6465464">
<p>
allofでコンポーネントを組み合わせ、共通化できる。
</p>
</div>
</div>
<div id="outline-container-org3b1af97" class="outline-3">
<h3 id="org3b1af97"><a href="#org3b1af97"><a href="https://github.com/freee/freee-api-schema">freee/freee-api-schema: schema file of freee API</a></a></h3>
<div class="outline-text-3" id="text-org3b1af97">
<p>
freeeのAPIスキーマ。openapiの参考にする。
</p>
</div>
</div>
<div id="outline-container-orgaad09db" class="outline-3">
<h3 id="orgaad09db"><a href="#orgaad09db"><a href="https://baasinfo.net/?p=4418">OAuth vs SAML vs OpenID Connect vs SSO それぞれの違い。 │ BaaS info !!</a></a></h3>
<div class="outline-text-3" id="text-orgaad09db">
<p>
よくわからなくなる3つ。
</p>
</div>
</div>
<div id="outline-container-org9e1d31d" class="outline-3">
<h3 id="org9e1d31d"><a href="#org9e1d31d"><a href="https://qiita.com/tkek321/items/55a1c3a3f78356045c03">Keycloak で Opent ID Connect 認可コードフローをやってみる - Qiita</a></a></h3>
<div class="outline-text-3" id="text-org9e1d31d">
<p>
Keycloakの解説記事。
</p>
</div>
</div>
<div id="outline-container-org56276fb" class="outline-3">
<h3 id="org56276fb"><a href="#org56276fb"><a href="https://tech-blog.rakus.co.jp/entry/20220408/architect">認証アーキテクチャの更新について検討してみた - RAKUS Developers Blog | ラクス エンジニアブログ</a></a></h3>
<div class="outline-text-3" id="text-org56276fb">
<p>
実装記事。
</p>
</div>
</div>
</div>
<div id="outline-container-orga2baba9" class="outline-2">
<h2 id="orga2baba9"><a href="#orga2baba9">Archives</a></h2>
<div class="outline-text-2" id="text-orga2baba9">
</div>
<div id="outline-container-org906c3ce" class="outline-3">
<h3 id="org906c3ce"><a href="#org906c3ce"><span class="done DONE">DONE</span> OpenAPIの使い方を調べる</a></h3>
<div class="outline-text-3" id="text-org906c3ce">
<p>
API設計・ドキュメント作成をスムーズに行えるようにする。
</p>

<ul class="org-ul">
<li>モックサーバ</li>
<li>PDF生成</li>
</ul>

<p>
まあ、楽にできる。いくつかの例からyamlを覚えればいいだけだ。あとは継続的にドキュメントをアップデートできる仕組み…たとえば実装と合っているかテストする(<a href="20210509095946-rails.html#ID-e04aa1a3-509c-45b2-ac64-53d69c961214">Rails</a>でいうところのCommitee)を入れれば、完璧。
</p>

<ul class="org-ul">
<li><a href="https://nextat.co.jp/staff/archives/253">LaravelアプリケーションのAPIがSwagger/OpenAPIドキュメントに準拠していることを透過的にテストする｜Laravel｜PHP｜開発ブログ｜株式会社Nextat（ネクスタット）</a></li>
<li><a href="https://github.com/lezhnev74/openapi-psr7-validator">lezhnev74/openapi-psr7-validator: It validates PSR-7 messages (HTTP request/response) against OpenAPI specifications</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgef82123" class="outline-3">
<h3 id="orgef82123"><a href="#orgef82123"><span class="done DONE">DONE</span> my_openapi整理</a></h3>
<div class="outline-text-3" id="text-orgef82123">
<ul class="org-ul">
<li><a href="https://github.com/kijimaD/my_openapi">kijimaD/my_openapi</a></li>

<li>例を整理した。</li>
<li>Lintを<a href="20220427215330-github_actions.html#ID-2d35ac9e-554a-4142-bba7-3c614cbfe4c4">GitHub Actions</a>で実行させた</li>
<li>ビルドを<a href="20220427215330-github_actions.html#ID-2d35ac9e-554a-4142-bba7-3c614cbfe4c4">GitHub Actions</a>で実行させた</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
